CSI API ETABS v1
cDesignConcrete.GetResultsAvailable Method
 This function determines if the concrete frame design results are available.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
bool GetResultsAvailable()
Function GetResultsAvailable As Boolean
Dim instance As cDesignConcrete
Dim returnValue As Boolean
returnValue = instance.GetResultsAvailable()
bool GetResultsAvailable()
abstract GetResultsAvailable : unit -> bool
Return Value
Type: Boolean
Returns True if the concrete frame design results are available, otherwise it returns False.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim ResultsAvailable as Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
   'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()
   'check if design results are available
       ResultsAvailable = SapModel.DesignConcrete.GetResultsAvailable
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace